# Pandas with SQL

In [8]:
import sqlite3 as sqlite
import pandas as pd
from sqlalchemy import create_engine

For demonstration, create a database, `population.db`, and insert one table with the name, `Population`, which represents the population in different countries.

In [9]:
with sqlite.connect('population.db') as con:
    cur = con.cursor()
    cur.execute("CREATE TABLE IF NOT EXISTS Population(id INTEGER PRIMARY KEY, country TEXT, population INT)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Germany',81197537)")
    cur.execute("INSERT INTO Population VALUES(NULL,'France', 66415161)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Italy', 60795612)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")

In [10]:
connection = create_engine('sqlite:///population.db')
connection

Engine(sqlite:///population.db)

## `read_sql_query()`

This method requires two perameters as input. The first parameter is a string with an SQL query and the second one is a connection to the database.

In [12]:
query = 'SELECT * FROM Population'

with connection.connect() as con:
    df = pd.read_sql_query(query, con)

df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

## `read_sql_table()`

Another way to load data from the database and into the data-frame is this method. Compared to `read_sql_query()`, the first argument is the table name instead of the SQL query. The second argument is the same.

In [13]:
table = 'Population'

with connection.connect() as con:
    df = pd.read_sql_table(table, con)

df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

## `read_sql()`

This function is a combination of the two mentioned above. Depending on the type of the first argument (SQL query or table name), this function internally calls `read_sql_query()` instead of `read_sql_table`.

So it be used in both ways:

In [14]:
with connection.connect() as con:
    df_query = pd.read_sql(query, con)
    
df_query

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

In [15]:
with connection.connect() as con:
    df_table = pd.read_sql(table, con)

df_table

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864